# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 5
# 15
# Вывод: [1, 9, 13, 14, 19]

number = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
new_number =[]
print (number)
min=int (input ('Введите минимальное значение списка: '))
max=int (input ('Введите максимальное значение списка: '))
for indx, val in enumerate(number):
    if min<val<max:
        new_number.append (indx)
print (new_number)